# Introduction to Pandas

In [382]:
import pandas as pd

## Reading and Importing Data

We are going to use the House Sales in King County, USA dataset from Kaggle: https://www.kaggle.com/datasets/harlfoxem/housesalesprediction?select=kc_house_data.csv

In [383]:
df = pd.read_csv('kc_house_data.csv')

## Inspecting the Data

In [384]:
df.head(7)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503
5,7237550310,20140512T000000,1230000.0,4,4.50,5420,101930,1.0,0,0,...,11,3890,1530,2001,0,98053,47.6561,-122.005,4760,101930
6,1321400060,20140627T000000,257500.0,3,2.25,1715,6819,2.0,0,0,...,7,1715,0,1995,0,98003,47.3097,-122.327,2238,6819

In [385]:
df.tail(3)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
21610,1523300141,20140623T000000,402101.0,2,0.75,1020,1350,2.0,0,0,...,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007
21611,291310100,20150116T000000,400000.0,3,2.50,1600,2388,2.0,0,0,...,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287
21612,1523300157,20141015T000000,325000.0,2,0.75,1020,1076,2.0,0,0,...,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357

We can use the following code to have a better view of our data and to control what to be displayed:

In [386]:
with pd.option_context('display.max_rows', 8, 'display.max_columns', None):
    display(df)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,3,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,3,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,3,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,5,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21609,6600060120,20150223T000000,400000.0,4,2.50,2310,5813,2.0,0,0,3,8,2310,0,2014,0,98146,47.5107,-122.362,1830,7200
21610,1523300141,20140623T000000,402101.0,2,0.75,1020,1350,2.0,0,0,3,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007
21611,291310100,20150116T000000,400000.0,3,2.50,1600,2388,2.0,0,0,3,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287
21612,1523300157,20141015T000000,325000.0,2,0.75,1020,1076,2.0,0,0,3,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357

### Displaying Columns

We can see all of the columns by using the follwoing function:

In [387]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

### Dataset Information

We can even easily check the number of columns and rows:

In [388]:
df.shape
# Output: (nb of rows, nb of columns)

(21613, 21)

Using len() returns number of rows:

In [389]:
len(df)

21613

Let's check more info:

In [390]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  float64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21613 non-null  int64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(5), int64(15), object(1)
memory usage: 3.5+ MB

We can see the variable names under 'Column', the number of values that are not missing in each column under 'Non-Null Count' (in this dataset no missing values in all columns), and the type of each variable under 'Dtype'. We have 5 variables of type float, 15 integer variables, and 1 object.

## null Values: How to deal with them?

Let's introduce some null values in our dataset just for the sake of understanding how to deal with them when a dataset actually has null values.

First, we need to use numpy module to introduce a percentage of null values in the dataset, but let's work on a copy with some of the columns.

In [391]:
df2 = df.iloc[:,[2,3,4,6,8,9,10,11,14]].copy()

In [392]:
import numpy as np
missing_percentage = 0.15
mask = np.random.rand(*df2.shape) < missing_percentage
df2[mask] = np.nan

Let's see if that worked.

In [393]:
df2.head()

,price,bedrooms,bathrooms,sqft_lot,waterfront,view,condition,grade,yr_built
0,221900.0,3.0,1.00,5650.0,0.0,0.0,3.0,7.0,1955.0
1,NaN,3.0,2.25,7242.0,0.0,0.0,3.0,7.0,1951.0
2,180000.0,NaN,1.00,10000.0,0.0,0.0,3.0,NaN,1933.0
3,NaN,4.0,3.00,5000.0,0.0,0.0,5.0,7.0,1965.0
4,510000.0,3.0,2.00,8080.0,0.0,0.0,3.0,8.0,1987.0

In [394]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price       18376 non-null  float64
 1   bedrooms    18339 non-null  float64
 2   bathrooms   18384 non-null  float64
 3   sqft_lot    18435 non-null  float64
 4   waterfront  18401 non-null  float64
 5   view        18293 non-null  float64
 6   condition   18367 non-null  float64
 7   grade       18437 non-null  float64
 8   yr_built    18359 non-null  float64
dtypes: float64(9)
memory usage: 1.5 MB

As we can see, almost 25% of the data in each column now contains null values. Let's deal with it.<br>
Let's delete the rows containing missing values as a first approach:

In [396]:
df2_ = df2.dropna()
df2_.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4972 entries, 0 to 21608
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price       4972 non-null   float64
 1   bedrooms    4972 non-null   float64
 2   bathrooms   4972 non-null   float64
 3   sqft_lot    4972 non-null   float64
 4   waterfront  4972 non-null   float64
 5   view        4972 non-null   float64
 6   condition   4972 non-null   float64
 7   grade       4972 non-null   float64
 8   yr_built    4972 non-null   float64
dtypes: float64(9)
memory usage: 388.4 KB

Another approach would be to replace the missing values with ones that make sense.<br>
It sensible to use the average as an alternative for missing values in the price and sqft_lot columns, and the mode in the rest, assuming that they are categorical variables.

In [397]:
cols1 = ['price','sqft_lot']
cols2 = ['bedrooms','bathrooms','waterfront','view','condition','grade','yr_built']
df2[cols1] = df2[cols1].fillna(df_.mean())
df2[cols2] = df2[cols2].fillna(df_.mode())
df_.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        21613 non-null  float64
 1   bedrooms     21613 non-null  int64
 2   bathrooms    21613 non-null  float64
 3   sqft_living  21613 non-null  int64
 4   sqft_lot     21613 non-null  int64
 5   waterfront   21613 non-null  int64
 6   view         21613 non-null  int64
 7   condition    21613 non-null  int64
 8   grade        21613 non-null  int64
 9   yr_built     21613 non-null  int64
dtypes: float64(2), int64(8)
memory usage: 1.6 MB

```All missing values have been replaced. :)```

## Data Manipulation: Grouping

Let's try to see how grouping helps us understand our data better.

In [398]:
# Checking our columns
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

We will take part of our original dataframe:

In [399]:
col_list = ['price', 'bedrooms', 'bathrooms', 'sqft_living','sqft_lot','waterfront', 'view', 'condition', 'grade','yr_built']
df_ = df[col_list].copy()

Let's see the effect of the variable 'grade' on the prices:

In [400]:
df_.groupby('grade')['price'].mean().round()

grade
1      142000.0
3      205667.0
4      214381.0
5      248524.0
6      301917.0
7      402593.0
8      542895.0
9      773738.0
10    1072347.0
11    1497792.0
12    2192500.0
13    3710769.0
Name: price, dtype: float64

We break down the code and understand what is happening:<br>
**df_.groupby('grade')** groups the data by grade, and then **['price']** is used to retrieve the column corresponding to the prices. But this alone doesn't make sense... Say we're interested in the average prices of each grade, that's what **.mean()** is for, and finally, **.round()** just rounds up the averages to the nearest integer.
#### Insights:
```
The 'grade' variable determines the overall rating of the houses, it takes the values between 1 and 13. As observed, the average price of houses of each grade grows bigger as the grade gets higher. So, we can conclude that a house with a good grade is more expensive than that with a low grade, which makes sense.
```

Now, say we want to check if the view of the houses affect their prices:

In [401]:
df_.groupby('view')['price'].mean().round()

view
0     496624.0
1     812519.0
2     792746.0
3     972468.0
4    1464363.0
Name: price, dtype: float64

If we sort the prices in descending order:

In [402]:
df_.groupby('view')['price'].mean().round().sort_values(ascending = False)

view
4    1464363.0
3     972468.0
1     812519.0
2     792746.0
0     496624.0
Name: price, dtype: float64

```Obviously, the better the view (4 being the highest rating), the pricier the house.```

One can be tempted to check if the view rating is related the having a waterfront view, it will only make sense that it is:

In [403]:
df_.groupby('waterfront')['view'].mean().reset_index().rename(columns = {'view':'avg_view_rating'})

   waterfront  avg_view_rating
0           0         0.207459
1           1         3.766871

```As expected, the average view rating is much higher (3.76) when a house has a waterfront view than that with no waterfront view (0.2).```

Now let's see how that affects the average prices and grade:

In [404]:
df_.groupby(['view','waterfront'])[['price','grade']].mean().round()

                     price  grade
view waterfront
0    0            496624.0    8.0
1    0            813055.0    8.0
     1            635000.0    7.0
2    0            783955.0    8.0
     1           1842188.0    8.0
3    0            964685.0    9.0
     1           1173605.0    8.0
4    0           1270713.0    9.0
     1           1728300.0    9.0

```
The grade given to a house is not greatly influenced by having a waterfront view or a good view in general. Other factors could be responsible for the grades.
As for the prices, they are generally higher when the house has a waterfront view, and as seen above, houses with better view are generally more expensive.
```

In [405]:
df_.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,waterfront,view,condition,grade,yr_built
0,221900.0,3,1.00,1180,5650,0,0,3,7,1955
1,538000.0,3,2.25,2570,7242,0,0,3,7,1951
2,180000.0,2,1.00,770,10000,0,0,3,6,1933
3,604000.0,4,3.00,1960,5000,0,0,5,7,1965
4,510000.0,3,2.00,1680,8080,0,0,3,8,1987

Do houses with bigger areas tend to be graded higher?

In [406]:
df_.iloc[:,[3,4,8]].groupby('grade').mean().round()

       sqft_living  sqft_lot
grade
1            290.0   20875.0
3            597.0   26953.0
4            660.0   22101.0
5            983.0   24020.0
6           1192.0   12647.0
7           1689.0   11766.0
8           2185.0   13510.0
9           2868.0   20639.0
10          3520.0   28191.0
11          4395.0   38373.0
12          5472.0   54521.0
13          7483.0   28205.0

```
If we look at the first 5 rows, we notice that houses graded '1' to '5' (low grade) have a small living area and a huge total area on average. This could mean that most people wouldn't care to buy a small house with a huge yard or drive.
The average houses have average area, and the highest graded houses have both big living and lot areas.
So, the bigger the living area is, the more expensive the house is.
```

Let's see what the maximum and minimum grades given to a house in a bad condition is:

First, let's see our variable 'condition':

In [407]:
df_['condition'].describe().round()

count    21613.0
mean         3.0
std          1.0
min          1.0
25%          3.0
50%          3.0
75%          4.0
max          5.0
Name: condition, dtype: float64

```The house in the best condition is represented as a 5, the worst as a 1. 25% of the data points have a condition value of 3 or lower; this is called the first quartile. 50% and 75% represent the 2nd and 3rd quartiles respectively. The second quartile is also called the 'median'. In our case, it means that half the houses are in condition 3 or lower, and the other half are in conditions that are either 3 or higher. As for the 3rd quartile, it means that 75% of the data points have a condition value of 4 or lower.```

In [408]:
df_[['condition','grade']].groupby('condition').agg(['min','max','mean']).round()

          grade
            min max mean
condition
1             1   8  6.0
2             3  10  7.0
3             3  13  8.0
4             4  13  7.0
5             3  12  7.0

```
The average grades in all conditions are close to each other, it appears that the condition doesn't affect the grade much...
```

## Data Manipulation, Furthur Analysis

Let's find out how many houses were built in each year:

In [409]:
df_['yr_built'].value_counts()

yr_built
2014    559
2006    454
2005    450
2004    433
2003    422
       ...
1933     30
1901     29
1902     27
1935     24
1934     21
Name: count, Length: 116, dtype: int64

Let's make it look clearer:

In [410]:
df_yrs = pd.DataFrame(df_['yr_built'].value_counts().sort_values(ascending = False)).reset_index()
df_yrs

     yr_built  count
0        2014    559
1        2006    454
2        2005    450
3        2004    433
4        2003    422
..        ...    ...
111      1933     30
112      1901     29
113      1902     27
114      1935     24
115      1934     21

[116 rows x 2 columns]

Finding the total number of houses built before and after the year 2000:

In [411]:
# before 2000
df_1900 = df_yrs.loc[df_yrs['yr_built'] < 2000,:]
sum1900 = df_1900['count'].sum()
sum1900

16854

In [412]:
# after 2000
df_2000 = df_yrs.loc[df_yrs['yr_built'] > 2000,:]
sum2000 = df_2000['count'].sum()
sum2000

4541

Let's see our year range:

In [413]:
df_['yr_built'].agg(['min','max'])

min    1900
max    2015
Name: yr_built, dtype: int64

```All houses were built between the years 1900 and 2015.```

The following dataframe will help me find the percentages of each range easily.

In [414]:
df_perc = pd.DataFrame({'year': ['2000+','2000-'],'houses_built': [sum2000,sum1900]})
df_perc

    year  houses_built
0  2000+          4541
1  2000-         16854

In [415]:
df_perc['percentage'] = (df_perc['houses_built'] / len(df_)) *100
df_perc.round()

    year  houses_built  percentage
0  2000+          4541        21.0
1  2000-         16854        78.0

```
21% of the houses were built after the year 2000, in 15 years.
78% of the houses were built before the year 2000, in 100 years.

```

# Summary

The houses sold between the years 1900 and 2015 are graded according to several factors, that includes the view rating, having a waterfront view, the living area and potentially other factors.

```

```

# Bonus

## Correlation: corr()

In [416]:
df_.corr().round(2)

,price,bedrooms,bathrooms,sqft_living,sqft_lot,waterfront,view,condition,grade,yr_built
price,1.00,0.31,0.53,0.70,0.09,0.27,0.40,0.04,0.67,0.05
bedrooms,0.31,1.00,0.52,0.58,0.03,-0.01,0.08,0.03,0.36,0.15
bathrooms,0.53,0.52,1.00,0.75,0.09,0.06,0.19,-0.12,0.66,0.51
sqft_living,0.70,0.58,0.75,1.00,0.17,0.10,0.28,-0.06,0.76,0.32
sqft_lot,0.09,0.03,0.09,0.17,1.00,0.02,0.07,-0.01,0.11,0.05
waterfront,0.27,-0.01,0.06,0.10,0.02,1.00,0.40,0.02,0.08,-0.03
view,0.40,0.08,0.19,0.28,0.07,0.40,1.00,0.05,0.25,-0.05
condition,0.04,0.03,-0.12,-0.06,-0.01,0.02,0.05,1.00,-0.14,-0.36
grade,0.67,0.36,0.66,0.76,0.11,0.08,0.25,-0.14,1.00,0.45
yr_built,0.05,0.15,0.51,0.32,0.05,-0.03,-0.05,-0.36,0.45,1.00

Correlation is a statistical measure that quantifies the degree to which two variables change together in a predictable way. It indicates the strength and direction of the linear relationship between two numerical variables. Correlation doesn't imply causation; it only shows how changes in one variable are associated with changes in another variable. Positive values indicate a positive correlation (as one variable increases, the other tends to increase).
Negative values indicate a negative correlation (as one variable increases, the other tends to decrease).<br>
The closer the absolute value of the correlation coefficient is to 1, the stronger the correlation.

```
In our dataset, for example, there's a weak positive correlation (0.31) between the price and number of bedrooms.
There's a very weak neagtive correlation (-0.01) between the condition of the house and the total square footage area.
There's a strong positive correlation (0.7) between the price and the square footage of living area. This means that, on average, as the square footage of the living area increases, the price of the property tends to increase as well. This correlation suggests that larger living spaces are associated with higher property prices.
```